ArduCAM/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/dma.xml
<module id="DMA" HW_revision=""><register id="DEVICE_CFG" width="32" offset="0x0" internal="0" description="Device Configuration Status"><bitfield id="NUM_DMA_CHANNELS" description="Reflects the number of DMA channels available on the device" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="NUM_SRC_PER_CHANNEL" description="Reflects the number of DMA sources per channel" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="INTEGRATION_CFG" width="32" offset="0x0" internal="0" description="Integration Configuration Register"/><register id="SW_CHTRIG" width="32" offset="0x4" internal="0" description="Software Channel Trigger Register"><bitfield id="CH0" description="Write 1 triggers DMA_CHANNEL0" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="CH1" description="Write 1 triggers DMA_CHANNEL1" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="CH2" description="Write 1 triggers DMA_CHANNEL2" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="CH3" description="Write 1 triggers DMA_CHANNEL3" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="CH4" description="Write 1 triggers DMA_CHANNEL4" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="CH5" description="Write 1 triggers DMA_CHANNEL5" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="CH6" description="Write 1 triggers DMA_CHANNEL6" begin="6" end="6" width="1" rwaccess="R/W"/><bitfield id="CH7" description="Write 1 triggers DMA_CHANNEL7" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="CH8" description="Write 1 triggers DMA_CHANNEL8" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="CH9" description="Write 1 triggers DMA_CHANNEL9" begin="9" end="9" width="1" rwaccess="R/W"/><bitfield id="CH10" description="Write 1 triggers DMA_CHANNEL10" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="CH11" description="Write 1 triggers DMA_CHANNEL11" begin="11" end="11" width="1" rwaccess="R/W"/><bitfield id="CH12" description="Write 1 triggers DMA_CHANNEL12" begin="12" end="12" width="1" rwaccess="R/W"/><bitfield id="CH13" description="Write 1 triggers DMA_CHANNEL13" begin="13" end="13" width="1" rwaccess="R/W"/><bitfield id="CH14" description="Write 1 triggers DMA_CHANNEL14" begin="14" end="14" width="1" rwaccess="R/W"/><bitfield id="CH15" description="Write 1 triggers DMA_CHANNEL15" begin="15" end="15" width="1" rwaccess="R/W"/><bitfield id="CH16" description="Write 1 triggers DMA_CHANNEL16" begin="16" end="16" width="1" rwaccess="R/W"/><bitfield id="CH17" description="Write 1 triggers DMA_CHANNEL17" begin="17" end="17" width="1" rwaccess="R/W"/><bitfield id="CH18" description="Write 1 triggers DMA_CHANNEL18" begin="18" end="18" width="1" rwaccess="R/W"/><bitfield id="CH19" description="Write 1 triggers DMA_CHANNEL19" begin="19" end="19" width="1" rwaccess="R/W"/><bitfield id="CH20" description="Write 1 triggers DMA_CHANNEL20" begin="20" end="20" width="1" rwaccess="R/W"/><bitfield id="CH21" description="Write 1 triggers DMA_CHANNEL21" begin="21" end="21" width="1" rwaccess="R/W"/><bitfield id="CH22" description="Write 1 triggers DMA_CHANNEL22" begin="22" end="22" width="1" rwaccess="R/W"/><bitfield id="CH23" description="Write 1 triggers DMA_CHANNEL23" begin="23" end="23" width="1" rwaccess="R/W"/><bitfield id="CH24" description="Write 1 triggers DMA_CHANNEL24" begin="24" end="24" width="1" rwaccess="R/W"/><bitfield id="CH25" description="Write 1 triggers DMA_CHANNEL25" begin="25" end="25" width="1" rwaccess="R/W"/><bitfield id="CH26" description="Write 1 triggers DMA_CHANNEL26" begin="26" end="26" width="1" rwaccess="R/W"/><bitfield id="CH27" description="Write 1 triggers DMA_CHANNEL27" begin="27" end="27" width="1" rwaccess="R/W"/><bitfield id="CH28" description="Write 1 triggers DMA_CHANNEL28" begin="28" end="28" width="1" rwaccess="R/W"/><bitfield id="CH29" description="Write 1 triggers DMA_CHANNEL29" begin="29" end="29" width="1" rwaccess="R/W"/><bitfield id="CH30" description="Write 1 triggers DMA_CHANNEL30" begin="30" end="30" width="1" rwaccess="R/W"/><bitfield id="CH31" description="Write 1 triggers DMA_CHANNEL31" begin="31" end="31" width="1" rwaccess="R/W"/></register><register id="STALL_STATUS" width="32" offset="0x8" internal="0" description="Stall Status Register"/><register id="CH_SRCCFG0" width="32" offset="0x10" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG1" width="32" offset="0x14" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG2" width="32" offset="0x18" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG3" width="32" offset="0x1C" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG4" width="32" offset="0x20" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG5" width="32" offset="0x24" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG6" width="32" offset="0x28" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG7" width="32" offset="0x2C" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG8" width="32" offset="0x30" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG9" width="32" offset="0x34" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG10" width="32" offset="0x38" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG11" width="32" offset="0x3C" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG12" width="32" offset="0x40" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG13" width="32" offset="0x44" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG14" width="32" offset="0x48" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG15" width="32" offset="0x4C" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG16" width="32" offset="0x50" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG17" width="32" offset="0x54" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG18" width="32" offset="0x58" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG19" width="32" offset="0x5C" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG20" width="32" offset="0x60" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG21" width="32" offset="0x64" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG22" width="32" offset="0x68" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG23" width="32" offset="0x6C" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG24" width="32" offset="0x70" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG25" width="32" offset="0x74" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG26" width="32" offset="0x78" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG27" width="32" offset="0x7C" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG28" width="32" offset="0x80" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG29" width="32" offset="0x84" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG30" width="32" offset="0x88" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CH_SRCCFG31" width="32" offset="0x8C" internal="0" description="Channel n Source Configuration Register"><bitfield id="DMA_SRC" description="Controls which device level DMA source is mapped to the channel" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="REQ_STATUS" width="32" offset="0x10" internal="0" description="Request Status Register"/><register id="SREQ_STATUS" width="32" offset="0x18" internal="0" description="Single Request Status Register"/><register id="DONE_SET" width="32" offset="0x20" internal="0" description="Done Set Register"/><register id="DONE_CLR" width="32" offset="0x24" internal="0" description="Done Clear Register"/><register id="ACTIVE_SET" width="32" offset="0x28" internal="0" description="Active Set Register"/><register id="ACTIVE_CLR" width="32" offset="0x2C" internal="0" description="Active Clear Register"/><register id="ERR_SET" width="32" offset="0x48" internal="0" description="Bus Error Set Register"/><register id="INT1_SRCCFG" width="32" offset="0x100" internal="0" description="Interrupt 1 Source Channel Configuration"><bitfield id="INT_SRC" description="Controls which channel's completion event is mapped as a source" begin="4" end="0" width="5" rwaccess="R/W"/><bitfield id="EN" description="When 1, enables the DMA_INT1 mapping." begin="5" end="5" width="1" rwaccess="R/W"/></register><register id="INT2_SRCCFG" width="32" offset="0x104" internal="0" description="Interrupt 2 Source Channel Configuration Register"><bitfield id="INT_SRC" description="Controls which channel's completion event is mapped as a source" begin="4" end="0" width="5" rwaccess="R/W"/><bitfield id="EN" description="When 1, enables the DMA_INT2 mapping." begin="5" end="5" width="1" rwaccess="R/W"/></register><register id="INT3_SRCCFG" width="32" offset="0x108" internal="0" description="Interrupt 3 Source Channel Configuration Register"><bitfield id="INT_SRC" description="Controls which channel's completion event is mapped as a source" begin="4" end="0" width="5" rwaccess="R/W"/><bitfield id="EN" description="When 1, enables the DMA_INT3 mapping." begin="5" end="5" width="1" rwaccess="R/W"/></register><register id="INT0_SRCFLG" width="32" offset="0x110" internal="0" description="Interrupt 0 Source Channel Flag Register"><bitfield id="CH0" description="If 1, indicates that Channel 0 was the source of DMA_INT0" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="CH1" description="If 1, indicates that Channel 1 was the source of DMA_INT0" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="CH2" description="If 1, indicates that Channel 2 was the source of DMA_INT0" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="CH3" description="If 1, indicates that Channel 3 was the source of DMA_INT0" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="CH4" description="If 1, indicates that Channel 4 was the source of DMA_INT0" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="CH5" description="If 1, indicates that Channel 5 was the source of DMA_INT0" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="CH6" description="If 1, indicates that Channel 6 was the source of DMA_INT0" begin="6" end="6" width="1" rwaccess="R/W"/><bitfield id="CH7" description="If 1, indicates that Channel 7 was the source of DMA_INT0" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="CH8" description="If 1, indicates that Channel 8 was the source of DMA_INT0" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="CH9" description="If 1, indicates that Channel 9 was the source of DMA_INT0" begin="9" end="9" width="1" rwaccess="R/W"/><bitfield id="CH10" description="If 1, indicates that Channel 10 was the source of DMA_INT0" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="CH11" description="If 1, indicates that Channel 11 was the source of DMA_INT0" begin="11" end="11" width="1" rwaccess="R/W"/><bitfield id="CH12" description="If 1, indicates that Channel 12 was the source of DMA_INT0" begin="12" end="12" width="1" rwaccess="R/W"/><bitfield id="CH13" description="If 1, indicates that Channel 13 was the source of DMA_INT0" begin="13" end="13" width="1" rwaccess="R/W"/><bitfield id="CH14" description="If 1, indicates that Channel 14 was the source of DMA_INT0" begin="14" end="14" width="1" rwaccess="R/W"/><bitfield id="CH15" description="If 1, indicates that Channel 15 was the source of DMA_INT0" begin="15" end="15" width="1" rwaccess="R/W"/><bitfield id="CH16" description="If 1, indicates that Channel 16 was the source of DMA_INT0" begin="16" end="16" width="1" rwaccess="R/W"/><bitfield id="CH17" description="If 1, indicates that Channel 17 was the source of DMA_INT0" begin="17" end="17" width="1" rwaccess="R/W"/><bitfield id="CH18" description="If 1, indicates that Channel 18 was the source of DMA_INT0" begin="18" end="18" width="1" rwaccess="R/W"/><bitfield id="CH19" description="If 1, indicates that Channel 19 was the source of DMA_INT0" begin="19" end="19" width="1" rwaccess="R/W"/><bitfield id="CH20" description="If 1, indicates that Channel 20 was the source of DMA_INT0" begin="20" end="20" width="1" rwaccess="R/W"/><bitfield id="CH21" description="If 1, indicates that Channel 21 was the source of DMA_INT0" begin="21" end="21" width="1" rwaccess="R/W"/><bitfield id="CH22" description="If 1, indicates that Channel 22 was the source of DMA_INT0" begin="22" end="22" width="1" rwaccess="R/W"/><bitfield id="CH23" description="If 1, indicates that Channel 23 was the source of DMA_INT0" begin="23" end="23" width="1" rwaccess="R/W"/><bitfield id="CH24" description="If 1, indicates that Channel 24 was the source of DMA_INT0" begin="24" end="24" width="1" rwaccess="R/W"/><bitfield id="CH25" description="If 1, indicates that Channel 25 was the source of DMA_INT0" begin="25" end="25" width="1" rwaccess="R/W"/><bitfield id="CH26" description="If 1, indicates that Channel 26 was the source of DMA_INT0" begin="26" end="26" width="1" rwaccess="R/W"/><bitfield id="CH27" description="If 1, indicates that Channel 27 was the source of DMA_INT0" begin="27" end="27" width="1" rwaccess="R/W"/><bitfield id="CH28" description="If 1, indicates that Channel 28 was the source of DMA_INT0" begin="28" end="28" width="1" rwaccess="R/W"/><bitfield id="CH29" description="If 1, indicates that Channel 29 was the source of DMA_INT0" begin="29" end="29" width="1" rwaccess="R/W"/><bitfield id="CH30" description="If 1, indicates that Channel 30 was the source of DMA_INT0" begin="30" end="30" width="1" rwaccess="R/W"/><bitfield id="CH31" description="If 1, indicates that Channel 31 was the source of DMA_INT0" begin="31" end="31" width="1" rwaccess="R/W"/></register><register id="INT0_CLRFLG" width="32" offset="0x114" internal="0" description="Interrupt 0 Source Channel Clear Flag Register"><bitfield id="CH0" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="CH1" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="CH2" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="CH3" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="CH4" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="CH5" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="CH6" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="6" end="6" width="1" rwaccess="R/W"/><bitfield id="CH7" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="CH8" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="CH9" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="9" end="9" width="1" rwaccess="R/W"/><bitfield id="CH10" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="CH11" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="11" end="11" width="1" rwaccess="R/W"/><bitfield id="CH12" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="12" end="12" width="1" rwaccess="R/W"/><bitfield id="CH13" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="13" end="13" width="1" rwaccess="R/W"/><bitfield id="CH14" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="14" end="14" width="1" rwaccess="R/W"/><bitfield id="CH15" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="15" end="15" width="1" rwaccess="R/W"/><bitfield id="CH16" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="16" end="16" width="1" rwaccess="R/W"/><bitfield id="CH17" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="17" end="17" width="1" rwaccess="R/W"/><bitfield id="CH18" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="18" end="18" width="1" rwaccess="R/W"/><bitfield id="CH19" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="19" end="19" width="1" rwaccess="R/W"/><bitfield id="CH20" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="20" end="20" width="1" rwaccess="R/W"/><bitfield id="CH21" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="21" end="21" width="1" rwaccess="R/W"/><bitfield id="CH22" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="22" end="22" width="1" rwaccess="R/W"/><bitfield id="CH23" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="23" end="23" width="1" rwaccess="R/W"/><bitfield id="CH24" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="24" end="24" width="1" rwaccess="R/W"/><bitfield id="CH25" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="25" end="25" width="1" rwaccess="R/W"/><bitfield id="CH26" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="26" end="26" width="1" rwaccess="R/W"/><bitfield id="CH27" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="27" end="27" width="1" rwaccess="R/W"/><bitfield id="CH28" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="28" end="28" width="1" rwaccess="R/W"/><bitfield id="CH29" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="29" end="29" width="1" rwaccess="R/W"/><bitfield id="CH30" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="30" end="30" width="1" rwaccess="R/W"/><bitfield id="CH31" description="Write 1 clears the corresponding flag bit in the DMA_INT0_SRCFL" begin="31" end="31" width="1" rwaccess="R/W"/></register></module>